Revit 2020 API
SurfaceNdfType Enumeration
 The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "PrismLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public enum SurfaceNdfType
Visual Basic
Public Enumeration SurfaceNdfType
Visual C++
public enum class SurfaceNdfType
Members
Member name | Description
Beckmann
Ggx
See Also
Autodesk.Revit.DB.Visual Namespace